
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

//!!! ДОБАВЛЯТЬ ВРУЧНУЮ!!!
Функция VerbExp()
	РВ = ПолучитьФорму("ВербальныеВыражения82", ЭтаФорма, Новый УникальныйИдентификатор);
	Возврат РВ.regexp_init();
КонецФункции
//!!! ДОБАВЛЯТЬ ВРУЧНУЮ!!!

Процедура EMailПриИзменении(Элемент)
	ЭлементыФормы.ПолеПроверкаEMail.Картинка = ЭлементыФормы.ЦветаРезультата.Кнопки.Нейтальный.Картинка;
КонецПроцедуры

Процедура IPПриИзменении(Элемент)
	ЭлементыФормы.ПолеПроверкаIP.Картинка = ЭлементыФормы.ЦветаРезультата.Кнопки.Нейтальный.Картинка;
КонецПроцедуры


Процедура ПроверитьEMailНажатие(Элемент)
	Результат = VerbExp().ЧтоНибудьКроме("@").Потом("@").ЧтоНибудьКроме("@").Затем(".").ЧтоНибудьКроме("@.").ОтДо(2, 6).Создать().СоответствуетШаблону(Email);
	Если Результат Тогда
		ЭлементыФормы.ПолеПроверкаEMail.Картинка = ЭлементыФормы.ЦветаРезультата.Кнопки.Зеленый.Картинка;
	Иначе
		ЭлементыФормы.ПолеПроверкаEMail.Картинка = ЭлементыФормы.ЦветаРезультата.Кнопки.Красный.Картинка;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьIPНажатие(Элемент)
	ПервыйВариант = VerbExp().Найди("25").Диапазон("0", "5").ПолучитьСтроку();
	ВторойВариант = VerbExp().Найди("2").Диапазон("0", "4").Цифра().ПолучитьСтроку();
	ТретийВариант = VerbExp().ДальшеМожетБыть().ЛюбойИз("01").ДальшеМожетБыть().Цифра().Цифра().ПолучитьСтроку();
	РВ = VerbExp().ОдинИз(ПервыйВариант, ВторойВариант, ТретийВариант);
	
	РВ2 = VerbExp().ВНачалеСтроки().НачатьГруппу().Найди(РВ).Потом(".").ЗакончитьГруппу().Раз(3).Потом(РВ).Создать();	
	Результат = РВ2.СоответствуетШаблону(IP);
	Если Результат Тогда
		ЭлементыФормы.ПолеПроверкаIP.Картинка = ЭлементыФормы.ЦветаРезультата.Кнопки.Зеленый.Картинка;
	Иначе
		ЭлементыФормы.ПолеПроверкаIP.Картинка = ЭлементыФормы.ЦветаРезультата.Кнопки.Красный.Картинка;
	КонецЕсли;
КонецПроцедуры

